In [12]:
import pandas as pd
file_path = '../shopping_data/shopping_data.csv'
sp_df = pd.read_csv(file_path, encoding="ISO-8859-1")
sp_df.head()

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [13]:
# Columns
sp_df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [14]:
sp_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [15]:
#find null values
for column in sp_df.columns:
    print(f"Column{column}has{sp_df[column].isnull().sum()}null values")

ColumnCustomerIDhas0null values
ColumnCard Memberhas2null values
ColumnAgehas2null values
ColumnAnnual Incomehas0null values
ColumnSpending Score (1-100)has1null values

In [16]:
#find duplicate entries
print(f"Duplicate entries: {sp_df.duplicated().sum()}")

Duplicate entries: 0

In [17]:
#Remove the unnessary column
sp_df.drop(columns=["CustomerID"],inplace=True)
sp_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [18]:
#Transform string 
def change_string(member):
    if member == "Yes":
        return 1
    else:
        return 0
sp_df["Card Member"] = sp_df["Card Member"].apply(change_string)
sp_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [19]:
#Scale Annual Income
sp_df["Annual Income"] = sp_df["Annual Income"]/1000
sp_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0           15.0                    39.0
1            1  21.0           15.0                    81.0
2            0  20.0           16.0                     6.0
3            0  23.0           16.0                    77.0
4            0  31.0           17.0                    40.0

In [20]:
#Reformat the names of the columns so they contain no spaces or numbers.

In [21]:
sp_df_t = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
sp_df_t

   A  B
0  1  4
1  2  5
2  3  6

In [22]:
sp_df_t.rename(columns={"A": "d", "B": "e"},inplace=True)
sp_df_t

   d  e
0  1  4
1  2  5
2  3  6

In [23]:
sp_df.rename(columns={"Card Member": "Card_Member", "Annual Income": "Annual_Income", "Spending Score (1-100)": "Spending_Score"},inplace=True)
sp_df

     Card_Member   Age  Annual_Income  Spending_Score
0              1  19.0           15.0            39.0
1              1  21.0           15.0            81.0
2              0  20.0           16.0             6.0
3              0  23.0           16.0            77.0
4              0  31.0           17.0            40.0
..           ...   ...            ...             ...
198            0  35.0          120.0            79.0
199            0  45.0          126.0            28.0
200            1  32.0          126.0            74.0
201            1  32.0          137.0            18.0
202            1  30.0          137.0            83.0

[203 rows x 4 columns]

In [13]:
#Saving cleaned data
file_path = "../shopping_data_cleaned.csv"
sp_df.to_csv(file_path, index = False)